{"prompt":  "How many codes are there from the HGNC dataset?", "completion":  " MATCH (hgnc: Code {SAB : 'HGNC'})  RETURN count(hgnc) as hgnc_cnt###"}
{"prompt":  "What phenotypes are related to HGNC:10593?", "completion":  " MATCH (gene:Code {CODE:'HGNC:10593'})--(gene_C:Concept)-[r]-(hpo_C:Concept)-[c:CODE]-(hpo:Code {SAB: 'HPO'})-[]-(hpo_term:Term)  RETURN distinct hpo_term.name###"}
{"prompt":  "What phenotypes are related to HGNC:3756?", "completion":  " MATCH (gene:Code {CODE:'HGNC:3756'})--(gene_C:Concept)-[r]-(hpo_C:Concept)-[c:CODE]-(hpo:Code {SAB: 'HPO'})-[]-(hpo_term:Term)  RETURN distinct hpo_term.name###"}
{"prompt":  "What phenotypes are related to HGNC:7584?", "completion":  " MATCH (gene:Code {CODE:'HGNC:7584'})--(gene_C:Concept)-[r]-(hpo_C:Concept)-[c:CODE]-(hpo:Code {SAB: 'HPO'})-[]-(hpo_term:Term)  RETURN distinct hpo_term.name###"}
{"prompt":  "What genes are related to the phenotype HP:0031329?", "completion":  " MATCH (hpo:Code {CODE:'HP:0031329'})--(hpo_C:Concept)-[r]-(gene_C:Concept)-[c:CODE]-(gene:Code {SAB: 'HGNC'})-[:MTH_ACR]-(gene_term:Term) RETURN distinct gene_term.name###"}
{"prompt":  "What genes are related to HP:0031295?", "completion":  " MATCH (hpo:Code {CODE:'HP:0031295'})--(hpo_C:Concept)-[r]-(gene_C:Concept)-[c:CODE]-(gene:Code {SAB: 'HGNC'})-[:MTH_ACR]-(gene_term:Term) RETURN distinct gene_term.name###"}
{"prompt":  "What genes are related to HP:0025579?", "completion":  " MATCH (hpo:Code {CODE:'HP:0025579'})--(hpo_C:Concept)-[r]-(gene_C:Concept)-[c:CODE]-(gene:Code {SAB: 'HGNC'})-[:MTH_ACR]-(gene_term:Term) RETURN distinct gene_term.name###"}
{"prompt":  "What are 100 gene expression levels for 0005659 where gene expression is greater than .8?", "completion":  " MATCH (ub_code:Code {SAB:'UBERON',CODE:'0005659'})-[r0:CODE]-(ub_cui:Concept)-[r1:tissue_has_median_expression]-(gtex_exp_cui:Concept)-[r2:CODE]-(gtex_exp_code:Code {SAB:'GTEX_EXP'})-[r3]-(gtex_term:Term) where gtex_term.lowerbound > .8 RETURN gtex_exp_code.CODE AS gtex, gtex_term.name AS exp limit 100###"}
{"prompt":  "What are 35 gene expression levels for 2001696 where gene expression is greater than .6?", "completion":  " MATCH (ub_code:Code {SAB:'UBERON',CODE:'2001696'})-[r0:CODE]-(ub_cui:Concept)-[r1:tissue_has_median_expression]-(gtex_exp_cui:Concept)-[r2:CODE]-(gtex_exp_code:Code {SAB:'GTEX_EXP'})-[r3]-(gtex_term:Term) where gtex_term.lowerbound > .6 RETURN gtex_exp_code.CODE AS gtex, gtex_term.name AS exp limit 35###"}
{"prompt":  "What are the gene expression levels for 0001733 where gene expression is greater than .9?", "completion":  " MATCH (ub_code:Code {SAB:'UBERON',CODE:'0001733'})-[r0:CODE]-(ub_cui:Concept)-[r1:tissue_has_median_expression]-(gtex_exp_cui:Concept)-[r2:CODE]-(gtex_exp_code:Code {SAB:'GTEX_EXP'})-[r3]-(gtex_term:Term) where gtex_term.lowerbound > .9 RETURN gtex_exp_code.CODE AS gtex, gtex_term.name###"}
{"prompt":  "Show EQTL double", "completion":  " MATCH (eqtl:Code {SAB:'GTEX_EQTL'})-[r]-(c:Concept) MATCH (c)-[*1]-(cc:Concept) RETURN c,cc limit 2###"}
{"prompt":  "Show EXP triple", "completion":  " MATCH (eqtl:Code {SAB:'GTEX_EXP'})-[r]-(c:Concept) MATCH (c)-[*1]-(cc:Concept) RETURN c,cc limit 3###"}
{"prompt":  "Return an example of the HUBMAP schema", "completion":  " MATCH (c1:Code {SAB:'HUBMAPsc'})-[:CODE]-(c2:Concept)-[:cluster_has_hubmap_node]-(c0:Concept)-[:CODE]-(code_cluster:Code {SAB:'HUBMAPsc CLUSTER'}) MATCH (c0)-[r]-(c3:Concept)-[:CODE]-(dataset_code:Code {SAB:'HUBMAPsc DATASET'}) MATCH (c3)-[r1:hubmap_dataset_contains_tissue]-(c4:Concept)-[:CODE]-(tissue_code:Code) RETURN * limit 1###"}
{"prompt":  "Show relationships between a hubmap node, cluster node, dataset node and tissue node.", "completion":  " MATCH (c1:Code {SAB:'HUBMAP'})-[:CODE]-(c2:Concept)-[:cluster_has_hubmap_node]-(c0:Concept)-[:CODE]-(code_cluster:Code {SAB:'HUBMAP CLUSTER'}) MATCH (c0)-[r]-(c3:Concept)-[:CODE]-(dataset_code:Code {SAB:'HUBMAP DATASET'}) MATCH (c3)-[r1:hubmap_dataset_contains_tissue]-(c4:Concept)-[:CODE]-(tissue_code:Code) RETURN * limit 1###"}
{"prompt":  "Show all the tissue nodes in 5ba6a5b81e95c93c26a33980f6e957d7", "completion":  " WITH '5ba6a5b81e95c93c26a33980f6e957d7' as study_id MATCH  (c0:Concept)-[r1:hubmap_dataset_contains_tissue]-(c3:Concept)-[:CODE]-(dataset_code:Code {SAB:'HUBMAP DATASET',CODE:study_id}) RETURN *###"}
{"prompt":  "Get the study_id, hgnc_id, cluster and gene expression from the dataset 5ba6a5b81e95c93c26a33980f6e957d7, the donor 1785aae4f0fb8f13a56d79957d1cbedf, and 7 and 8 as the clusters", "completion":  " WITH '5ba6a5b81e95c93c26a33980f6e957d7' as DATASET_ID, '1785aae4f0fb8f13a56d79957d1cbedf' as DONOR_ID, ['7','8'] as CLUSTERS MATCH (cluster_code:Code {SAB:'HUBMAP CLUSTER'})-[r0]-(c0:Concept)-[r1]->(c1:Concept)-[r2]-(dataset_code:Code {SAB:'HUBMAP DATASET',CODE:DATASET_ID}) where split(cluster_code.CODE,' ')[-1] IN CLUSTERS MATCH (c0)-[r8]-(c6:Concept)-[:CODE]-(hubmap_code:Code {SAB:'HUBMAP'})-[r9]-(t:Term) RETURN split(hubmap_code.CODE,' ')[0] as study_id,  split(hubmap_code.CODE,' ')[-1] as hgnc_gene, split(cluster_code.CODE,' ')[-1] as cluster, t.name as exp_bin order by cluster limit 5###"}
{"prompt":  "Return the dataset_id and donor_id from the study 046251c94ea0e79ee935dd3de57e093c", "completion":  " WITH '046251c94ea0e79ee935dd3de57e093c' AS STUDY_ID MATCH (hcode:Code {SAB:'HUBMAP'})-[:CODE]-(hcui:Concept)-[r8]-(cluster_cui:Concept)-[r7]-(cluster_code:Code {SAB:'HUBMAP CLUSTER'}) WHERE SPLIT(hcode.CODE,' ')[0] = STUDY_ID MATCH (cluster_cui:Concept)-[r1]->(dset_cui:Concept)-[:CODE]-(dataset_code:Code {SAB:'HUBMAP DATASET'}) MATCH (dset_cui)-[r2]-(donor_cui:Concept)-[:CODE]-(donor_code:Code {SAB:'HUBMAP DONOR'}) RETURN  STUDY_ID, dataset_code.CODE AS DATASET_ID, donor_code.CODE AS DONOR_ID limit 1###"}
{"prompt":  "How many metadata cuis are in the dataset 5ba6a5b81e95c93c26a33980f6e957d7?", "completion":  " WITH '5ba6a5b81e95c93c26a33980f6e957d7' as dataset_id MATCH (c0:Concept)<-[r1]-(c3:Concept)-[:CODE]-(dataset_code:Code {SAB:'HUBMAP DATASET',CODE:dataset_id}) where not r1.SAB in ['HUBMAP_DATASET__TISSUE','HUBMAP_CLUSTER__HUBMAP_DATASET'] RETURN count(r1)###"}
{"prompt":  "How many codes are there from the SAB dataset?", "completion":  " MATCH (hgnc_hcop: Code{SAB : 'HGNC'}) RETURN count(hgnc_hcop) as hgnc_hcop_cnt###"}
{"prompt":  "What phenotypes are related to 9787?", "completion":  " MATCH (gene:Code {CODE:'HGNC:9787'})--(gene_C:Concept)-[r]-(hpo_C:Concept)-[c:CODE]-(hpo:Code {SAB: 'HPO'})-[]-(hpo_term:Term) RETURN distinct hpo_term.name###"}
{"prompt":  "What phenotypes are related to 10593?", "completion":  " MATCH (gene:Code {CODE:'HGNC:10593'})--(gene_C:Concept)-[r]-(hpo_C:Concept)-[c:CODE]-(hpo:Code {SAB: 'HPO'})-[]-(hpo_term:Term) RETURN distinct hpo_term.name###"}
{"prompt":  "What phenotypes are related to 3756?", "completion":  " MATCH (gene:Code {CODE:'HGNC:3756'})--(gene_C:Concept)-[r]-(hpo_C:Concept)-[c:CODE]-(hpo:Code {SAB: 'HPO'})-[]-(hpo_term:Term) RETURN distinct hpo_term.name###"}
{"prompt":  "What phenotypes are related to 7584?", "completion":  " MATCH (gene:Code {CODE:'HGNC:7584'})--(gene_C:Concept)-[r]-(hpo_C:Concept)-[c:CODE]-(hpo:Code {SAB: 'HPO'})-[]-(hpo_term:Term) RETURN distinct hpo_term.name###"}
{"prompt":  "What genes are related to the phenotype HP:0025579?", "completion":  " MATCH (hpo:Code {CODE:'HP:0025579'})--(hpo_C:Concept)-[r]-(gene_C:Concept)-[c:CODE]-(gene:Code {SAB: 'HGNC'})-[:MTH_ACR]-(gene_term:Term) RETURN distinct gene_term.name###"}
{"prompt":  "What genes are related to the phenotype HP:0031295?", "completion":  " MATCH (hpo:Code {CODE:'HP:0031295'})--(hpo_C:Concept)-[r]-(gene_C:Concept)-[c:CODE]-(gene:Code {SAB: 'HGNC'})-[:MTH_ACR]-(gene_term:Term) RETURN distinct gene_term.name###"}
{"prompt":  "What are the gene expression levels for the tissue 0000947 where gene expression is greater than .8?", "completion":  " MATCH (ub_code:Code {SAB:'UBERON',CODE:'0000947'})-[r0:CODE]-(ub_cui:Concept)-[r1:tissue_has_median_expression]-(gtex_exp_cui:Concept)-[r2:CODE]-(gtex_exp_code:Code {SAB:'GTEX_EXP'})-[r3]-(gtex_term:Term) WHERE gtex_term.lowerbound > .8 RETURN gtex_exp_code.CODE AS gtex, gtex_term.name AS exp limit 100###"}
{"prompt":  "What are the gene expression levels for the tissue 0005659 where gene expression is greater than .8?", "completion":  " MATCH (ub_code:Code {SAB:'UBERON',CODE:'0005659'})-[r0:CODE]-(ub_cui:Concept)-[r1:tissue_has_median_expression]-(gtex_exp_cui:Concept)-[r2:CODE]-(gtex_exp_code:Code {SAB:'GTEX_EXP'})-[r3]-(gtex_term:Term) WHERE gtex_term.lowerbound > .8 RETURN gtex_exp_code.CODE AS gtex, gtex_term.name AS exp limit 100###"}
{"prompt":  "What are the gene expression levels for the tissue 2001696 where gene expression is greater than .8?", "completion":  " MATCH (ub_code:Code {SAB:'UBERON',CODE:'2001696'})-[r0:CODE]-(ub_cui:Concept)-[r1:tissue_has_median_expression]-(gtex_exp_cui:Concept)-[r2:CODE]-(gtex_exp_code:Code {SAB:'GTEX_EXP'})-[r3]-(gtex_term:Term) WHERE gtex_term.lowerbound > .8 RETURN gtex_exp_code.CODE AS gtex, gtex_term.name AS exp limit 100###"}
{"prompt":  "What are the gene expression levels for the tissue 0001733 where gene expression is greater than .8?", "completion":  " MATCH (ub_code:Code {SAB:'UBERON',CODE:'0001733'})-[r0:CODE]-(ub_cui:Concept)-[r1:tissue_has_median_expression]-(gtex_exp_cui:Concept)-[r2:CODE]-(gtex_exp_code:Code {SAB:'GTEX_EXP'})-[r3]-(gtex_term:Term) WHERE gtex_term.lowerbound > .8 RETURN gtex_exp_code.CODE AS gtex, gtex_term.name AS exp limit 100###"}
